package Utils.configration;

import java.io.File;
import java.io.FileInputStream;
import java.io.FileNotFoundException;
import java.io.IOException;
import java.util.Properties;

public class ConfigUtil {

    /*
     * 🛠️ ConfigUtil Class (مترجم الإعدادات)
     * ---------------------------------------------------------
     * 💡 وظيفته باختصار:
     * ده "الوسيط" اللي بيربط بين ملف الإعدادات الخارجي (config.properties) وبين كود الجافا.
     *
     * 🔄 الخطوات اللي بيعملها:
     * 1. بياخد مسار الملف (path).
     * 2. بيفتح "ماسورة" (FileInputStream) عشان يسحب البيانات من الملف.
     * 3. بيجهز "شنطة فاضية" (Properties Object).
     * 4. بيملا الشنطة دي بكل البيانات اللي في الملف (load).
     * 5. بيرجعلك الشنطة مليانة وجاهزة عشان تاخد منها اللي انت عاوزه (return).
     * ---------------------------------------------------------
     */

    public static Properties ReadConfig( String path) throws IOException {
        File file = new File(path); // الفايل عادي
        FileInputStream is = new FileInputStream(file); // دي الماسوره اللي بين الكود والهارد
        Properties prop = new Properties(); // دي السنطه اللي هنرص فيها البيانات اللي جايه من الملف
        prop.load(is);// هنا بقوله خد الماسوره ددي وحملي البيانات الللي فيها في الشنطه دي
        is.close(); // بعد ما خلصت من الماسوره دي، اقفلها عشان مفيش تسريب في الذاكرة
        return prop ; // هات الشنطه محمله بقا


    }
}
